Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputRelationConvertor
The Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputRelationConvertor class provides a conversion extension method for Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation.

Tekla.Structures.DirectManipulation.Adapter.Interaction.NumericInputRelationConvertor.Convert(Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation)
Converts a Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation value to a Tekla.BIM.DirectManipulation.Services.Interaction.NumericInputRelation value.
dotInputRelation: The Tekla.Structures.DirectManipulation.Adapter.Interaction.Native.dotNumericInputRelation value to convert.
Returns: A Tekla.BIM.DirectManipulation.Services.Interaction.NumericInputRelation value.